Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memb.tmx
Source language: cat
Languages: es

source: Els DVD actuals contenen uns 4,7 GB, però ja s'han devolupat tècniques que n'amplien considerablement la capacitat.
es: Los DVD actuales contienen unos 4,7 GB, pero ya se han desarrollado técnicas que amplían considerablemente la capacidad.

source: Una classificació no gaire exhaustiva dels diferents tipus d'ordinadors que podem trobar-nos avui dia és la següent:
es: A continuación una clasificación no muy exhaustiva de los diferentes tipos de ordenadores:

source: En les unitats de CD-ROM és important la velocitat màxima de transferència de dades, que es dóna com a múltiple de l'estàndard (la d'un CD de música, de l'ordre d'uns 150 kilooctets per segon): quàdrupla (4$$), sèxtupla (6$$), etc.
es: En las unidades de CD-ROM es importante la velocidad máxima de transferencia de datos, que se da como múltiple del estándar (la de un CD de música, del orden de unos 150 kilobytes por segundo): Cuatro ( 4X), séxtuplo (6X ), etc.

source: En el cas del mòdem més comú, el mòdem telefònic, es tracta d'un dispositiu (normalment una placa interna, encara que també pot ser extern) que permet usar la línia telefònica (senyals analògics) per a comunicacions informàtiques (digitals) entre dos ordinadors.
es: En el caso del módem más común, el módem telefónico </ i0>, se trata de un dispositivo (normalmente una placa interna, aunque también puede ser externo) que permite usar la línea telefónica (señales analógicas) para comunicaciones informáticas (digitales) entre dos ordenadores..

source: Això evita el parpalleig de les pantalles clàssiques i en redueix la grandària, tot i que també incrementa el preu.
es: Esto evita el parpadeo de las pantallas clásicas y reduce su tamaño, aunque también incrementa el precio.

source: [gigahertz:] un gigahertz són 1000 megahertz (vegeu megahertz en aquest glossari).
es: [Gigahertz:] un gigahertz son 1000 megahertz (véase megahertz </ i0> en este glosario).

source: Sobre algorismes
es: Sobre algoritmos

source: [adaptador de vídeo] (també anomenada targeta gràfica o controlador de vídeo): Targeta que permet connectar un monitor a l'ordinador.
es: [adaptador de vídeo] (conocido también como tarjeta gráfica o controlador de vídeo): Tejeta que permite conectar un monitor al ordenador.

source: El seu llibre, Kitab al-jabr wa al-muqabalah, o { Llibre de la integració i l'equació}, va donar nom també a l'àlgebra quan es va traduir al llatí en el segle XII.
es: Su libro, Kitab al-jabr wa al-muqabalah </ i1> o { Libro de la integración y la ecuación}, dio nombre también a wl álgebra </ i2> cuando se tradujo al latín en el siglo XII.

source: Els DVD són una classe de disc òptic més veloç i amb més capacitat que els CD-ROM
es: Los DVD son una clase de disco óptico más veloz y con más capacidad que los CD-ROM

source: Configuració d'un ordinador personal
es: Configuración de un ordenador personal

source: Se n'ha de considerar la resolució, és a dir, el nombre de punts, elements d'imatge (píxels) que caben en una imatge, per exemple $1024 768$ (horitzontal $$ vertical), i altres paràmetres com la { freqüència de refrescament} (que es mesura en hertzs o cicles per segon; vegeu ``megahertz'').
es: Se debe considerar la resolución </ i0>, es decir, el número de puntos, elementos de imagen ( píxeles </ i1>) que caben en una imagen, por ejemplo 1.024 x 768 (horizontal x vertical), y otros parámetros como la { frecuencia de refresco} (que se mide en hercios o ciclos por segundo; véase " megahercio").

source: Hi ha diversos estàndards de connexió en xarxa; els més anomenats són Ethernet i Token Ring.
es: Hay varios estándares de conexión en red, los más llamados son Ethernet y Token Ring.

source: Els algorismes s'enuncien en imperatiu, com si fossen ordres que es donen a algú perquè les execute seqüencialment, excepte quan es trenca l'ordre amb una instrucció ``Vés a''.
es: Los algoritmos se enuncian en imperativo </ i1>, como si fueran órdenes que se dan a alguien para que las ejecute secuencialmente, excepto cuando se rompe el orden con una instrucción " Ver".

source: De fet, per fidelitat al sistema binari, un kilooctet no té 1.000, sinó 1.024 octets ($2^{10}$ és $1.024$), és a dir 1.024$$8=8.192 bits.
es: De hecho, por fidelidad al sistema binario, un kilobyte no tiene 1.000, sino 1.024 bytes ($ 2 ¹° son 1.024 bytes), es decir 1.024x 8 = 8192 bits.

source: La velocitat de les unitats centrals dels ordinadors es mesura en MHz o GHz, és a dir, en milions o milers de milions de cicles bàsics de processament d'informació ---corresponents als tics o impulsos del rellotge que sincronitza tots els circuits de l'ordinador--- per segon.
es: La velocidad de las unidades centrales de los ordenadores se miden en MHz o GHz, es decir, en millones o millares de millones de ciclos básicos de procesamiento de información ---correspondientes a los tics o impulsos del reloj que sincroniza todos los dispositivos del ordenador--- por segundo.

source: [cache] o memòria cau: Memòria RAM intermèdia, d'accés més ràpid per part del processador, on es copia de quan en quan un bloc (també ``pàgina'') complet de posicions consecutives de la memòria RAM general per a simplificar accessos repetits a posicions en la mateixa zona.
es: [Cache] : Memoria RAM intermedia, de acceso más rápido por parte del procesador, donde se copia de cuando en cuando un blog (también " página") completo de posiciones consecutivas de la memoria RAM general para simplificar accesos repetidos a posiciones en la misma zona.

source: megaoctets o megabytes (MB), o milions d'octets.
es: megabytes </ i2> (MB), o millones de bytes.

source: } Aquest algorisme es pot convertir a un programa d'ordinador.
es: } Este algoritmo se puede convertir en un programa de ordenador.

source: [densitat alta:] Quan els disquets de 3 polzades i mitja (uns 90 mm) són de densitat alta solen estar marcats amb les lletres HD (high density) i poden emmagatzemar 1,44 MB de dades.
es: [densidad alta]: Cuando los disquets de 3 pulgadas y media( unos 90mm) son de densidad alta y están marcado con las letras HD (high density) pueden almacenar 1,44 MB de datos.

source: De tota manera, les velocitats mitjanes de tot un procés de lectura i escriptura solen ser més baixes.
es: De todas formas, las velocidades medias </ i0> de todo un proceso de lectura y escritura suelen ser más bajas.

source: [486:] Un model de processador central de la família 86, dissenyat per Intel i també per altres companyies, que es troba en ordinadors personals del tipus PC.
es: [486:] Un modelo de procesador central de la familia 86, diseñado por Intel y también por otras compañías, que se encuentra en ordenadores personales del tipo PC.

source: Si són de colors, cal més d'un bit per a cada punt.
es: Si son de colores, hay más de un bit por cada punto.

source: [MHz:] vegeu megahertz.
es: [MHGz:] ver megahercio.

source: Es distingeixen perquè els primers tenen un petit foradet quadrat addicional (a la part inferior dreta si posem la finestra dalt).
es: Se distingue porque los primeros tienen un agujerito cuadrado adicional ( en la parte inferior derecha si ponemos la ventana arriba).

source: Un dels paràmetres més interessants d'un mòdem és la velocitat de transmissió de dades, que es mesura en bps (bits per segon).
es: Uno de los parámetros más interesantes de un módem es la velocidad </ i1> de transmisión de datos, que se mide en bps (bits por segundo).

source: [ADSL] (de l'anglés asymmetric digital subscriber line, línia d'abonat digital asimètrica): Versió asimètrica de DSL (vegeu DSL).
es: [ADSL] (del inglés Asymmetric digital subscriber line </ i0>, línea de abonado digital asimétrica): Versión asimétrica de DSL (ver DSL).

source: La configuració clàssica d'un ordinador personal model 2006 sol ser més o menys com segueix: La unitat base (la ``caixa'' o la ``torre'') conté: El processador (típicament un Pentium d'Intel d'uns 3 GHz o un processador equivalent de la marca AMD), La memòria RAM (per exemple, de 1 GB), Una bona targeta gràfica, Un disc fix amb una capacitat de l'ordre dels 320 GB, la unitat de disquet, Una unitat enregistradora de DVD i de CD-ROM Una targeta de so amb altaveus i micròfon.
es: La configuración clásica de un ordenador personal modelo 2006 suele ser más o menos como la siguiente: La unidad base (la " caja" o la " torre") contiene: El procesador (típicamente un Pentium de Intel de unos 3 GHz o un procesador equivalente de la marca AMD), La memoria RAM (por ejemplo, de 1 GB), Una buena tarjeta gráfica, Un disco fijo con una capacidad del orden de los 320 GB, la unidad de disquete, Una unidad grabadora de DVD y de CD-ROM Una tarjeta de sonido con altavoces y micrófono.

source: Un CD-ROM conté uns 700 MB, tot i que també n'hi ha varietats que arriben als 900 MB.
es: Un CD-ROM contiene unos 700 MB, aunque también hay variedades que llegan a los 900 MB.

source: { ALGORISME COMPARA Entrada: Dues seqüències de caràcters $A$ i $B$. Eixida: Sí, si són iguals; no si no ho són.
es: { ALGORITMO COMPARA Entrada: Dos secuencias de caracteres $ A $ y $ B $. Salida: Sí </ i0>, si son iguales; no </ i1> si no lo son.

source: Una velocitat clàssica en mòdems domèstics és 33.600 bps (més recentment, 57.600 bps; les línies telefòniques actuals poden admetre potser velocitats al voltant dels 100.000 bps).
es: Una velocidad clásica en módems domésticos es 33.600 bps (más recientemente, 57.600 bps; las líneas telefónicas actuales pueden admitir quizá velocidades alrededor de los 100.000 bps).

source: Són, amb diferència, els ordinadors més habituals.
es: Son, con diferencia, los ordenadores más habituales.

source: Impressores matricials o d'agulles ja no se'n fan.
es: Impresoras matriciales o de agujas ya no se hacen.

source: Els adaptadors de vídeo bàsics més comuns són els adaptadors VGA o SuperVGA, encara que actualment n'hi ha de molt més avançats.
es: Los adaptadores de vídeo básicos más comunes son los adaptadores VGA o SuperVGA, aunque actualmente hay mucho más avanzados.

source: [1.] Fes que $p$ valga 1 ($p$ indica la posició actual dins de les seqüències que estem comparant: $p=1$, per al primer caràcter, $p=2$, per al segon, etc.) [2.] Si no existeix la posició $p$ de $A$, vés a 7.
es: ] Haz que $ p $ sirva 1 ($ p $ indica la posición actual dentro de las secuencias que estamos comparando: $ p = 1 $, para el primer carácter, $ p = 2 $, para el segundo, etc. ) [2.

source: Els disquets de densitat alta (marcats ``HD'') de 3,5 polzades, emmagatzemen 1,44 MB de dades i són un tipus un tipus de suport en desús.
es: Los disquetes de alta densidad (marcados " HD") de 3,5 pulgadas, almacenan 1,44 MB de datos y son un tipo de apoyo en desuso.

source: { ALGORISME COMPARA2 Entrada: Dues seqüències de caràcters $A$ i $B$, acabades en `\$'. Eixida: Sí, si són iguals; no si no ho són.
es: { ALGORITMO COMPARA2 Entrada: Dos secuencias de caracteres $ A $ y $ B $, acabadas en `$ '. Salida: Sí </ i0>, si son iguales; no </ i1> si no lo son.

source: Com que un octet pot contenir poca informació, normalment es parla de: kilooctets o kilobytes (kB), o milers d'octets.
es: Como un byte puede contener poca información, normalmente se habla de: kilobytes </ i0> (kB), o miles de bytes.

source: Fitxers i directoris
es: Ficheros y directorios

source: Per exemple, en un ordinador amb 512 kilooctets (524.288 octets) de memòria cau, després d'accedir a la posició 2.000.000 és molt probable que el processador vulga accedir a la posició 2.000.003.
es: Por ejemplo, en un ordenador con 512 kilooctets (524.288 bytes) de caché </ i1>, tras acceder a la posición 2.000.000 es muy probable que el procesador quiera acceder a la posición 2.000.003.

source: Normalment, cada disc té un { directori principal} o directori arrel (el més elevat en la jerarquia de directoris), dins del qual es troba tota la resta de directoris.
es: Normalmente, cada disco tiene un { directorio principal} o directorio raíz </ i0> (el más elevado en la jerarquía de directorios), dentro del cual se encuentra el resto de directorios.

source: El codi ASCII és el codi bàsic per a emmagatzemar textos; quan els textos són més rics i contenen informació sobre tipus i grandàries de lletra, diagramació, notes a peu de pàgina, etc., s'usen formats més avançats que s'expliquen en l'epígraf .
es: El código ASCII es el código básico para almacenar textos, cuando los textos son más ricos y contienen información sobre tipos y tamaños de letra, diagramación, notas a pie de página, etc.Se usan formatos más avanzados que se explican en el epígrafe .

source: Actualment, un dels usos més populars dels mòdems telefònics és la connexió del PC domèstic a Internet (vegeu l'apartat ). Hi ha altres tipus de mòdems, normalment més ràpids: mòdems de cable, que permeten connectar l'ordinador a Internet a través dels cables d'empreses especialitzares que ofereixen televisió, telèfon i Internet, mòdems ADSL (vegeu ADSL en aquest glossari), etc.
es: Actualmente, uno de los usos más populares de los módems telefónicos es la conexión del PC doméstico a Internet (véase el apartado ). Hay otros tipos de módems, normalmente más rápidos: módems de cable </ i4>, que permiten conectar el ordenador a Internet a través de los cables de empresas especializado que ofrece televisión, teléfono e Internet, módems ADSL </ i5> (ver ADSL </ e6> en este glosario) , etc.

source: Dos fitxers ---també dos directoris--- només poden tenir el mateix nom si es troben en directoris diferents.
es: Dos ficheros --- también dos directorios --- sólo pueden tener el mismo nombre si se encuentran en directorios diferentes.

source: Imagineu que en un disc hem creat l'estructura de fitxers i directoris següent: ( .{{}}.
es: Imaginad que en un disco hemos creado la estructura de ficheros y directorios siguiente: (. { {}}.

source: [Pentium:] nom genèric de diverses famílies de processadors d'Intel, successors del 486, amb un conjunt d'instruccions més complet i amb moltes millores internes.
es: [Pentium:] nombre genérico de varias familias de procesadores de Intel, sucesores del 486, con un conjunto de instrucciones más completo y con muchas mejoras internas.

source: En les imatges en blanc i negre, cada punt és un bit; una pantalla d'ordinador en conté més o menys un milió.
es: En las imágenes en blanco y negro, cada punto es un bit, una pantalla de ordenador contiene más o menos un millón.

source: L'asimetria fa referència al fet que la velocitat de transmissió de dades de la central cap a l'abonat és superior que la velocitat de transmissió de dades de l'abonat cap a la central (per exemple, 256 kB/s cap a l'abonat i 128 kB/s cap a la central).
es: La asimetría se refiere a que la velocidad de transmisión de datos de la central hacia el abonado es superior que la velocidad de transmisión de datos del abonado hacia la central (por ejemplo, 256 kB / s hacia la abonado y 128 kB / s hacia la central).

source: Tots aquests conceptes es veuen potser més clars amb un exemple.
es: Todos estos conceptos se ven quizás más claros con un ejemplo.

source: [7.] Si no existeix la posició $p$ de $B$, digues sí i para.
es: ] Si no existe la posición $ p $ de $ B $, di sí </ i0> y para.

source: [De sobretaula] (en anglés desktop): Estan formats per una caixa amb dispositius de processament i emmagatzematge i un conjunt de perifèrics com ara el teclat, el ratolí o la pantalla.
es: [De sobremesa] (en inglés desktop </ i0>): Están formados por una caja </ i1> con dispositivos de procesamiento y almacenamiento y un conjunto de periféricos como el teclado, el ratón o la pantalla .

source: De fet, convé considerar la trajectòria com a part del nom del fitxer, cosa que ens permetria dir, senzillament, que en un disc no pot haver-hi dos fitxers amb el mateix nom.
es: De hecho, conviene considerar la trayectoria como parte del nombre del archivo, lo que nos permitiría decir, sencillamente, que en un disco no puede haber dos archivos con el mismo nombre.

source: El nom sol ser normalment lliure, però l'extensió sol ser curta (entre una i quatre lletres) i sol identificar el programa que s'ha d'usar per a processar-lo o el format en què es troben les dades que conté (per exemple, l'extensió .txt identifica normalment un text senzill en format ASCII o ANSI, vegeu l'apartat ; l'extensió .exe s'usa per als programes d'ordinador, etc.).
es: El nombre suele ser libre, pero la extensión suele ser corta (entre una y cuatro letras) y suele identificar el programa que se debe usar para procesarlo o el formato en que se encuentran los datos que contiene ( por ejemplo, la extensión . txt </ i4> identifica normalmente un texto sencillo en formato ASCII o ANSI, véase el apartado ; la extensión . exe </ i5> se usa para los programas de ordenador, etc.).

source: Si necessitem guardar objectes o unitats d'informació que tenen més de dos valors possibles, no tindrem prou amb 1 bit; haurem de combinar més d'un bit.
es: Si necesitamos guardar objetos o unidades de información que tienen más de dos valores posibles, no tendremos suficiente con 1 bit; tendremos que combinar más de un bit.

source: També anomenats carpetes.
es: También llamados carpetas </ i2>.

source: Un teclat separat i un ratolí, típicament de tres botons.
es: Un teclado separado y un ratón, típicamente de tres botones.

source: Com que sovint no porten teclat, els caràcters s'hi introdueixen escrivint-los directament sobre la seua pantalla tàctil mitjançant un punter.
es: Como a menudo no llevan teclado, los caracteres se introducen escribiéndolos directamente sobre la pantalla táctil mediante un puntero.

source: Molts mòdems interns fan part de les seues funcions usant programari que s'executa en l'ordinador en comptes de maquinari especialitzat (``mitjos mòdems''), cosa que els fa dependents d'un sistema operatiu concret; això no passa amb els mòdems externs.
es: Muchos módems internos realizan parte de sus funciones usando el programatio que se ejecuta en el ordenador en vez de la maquinaria especializada ("medios modernos"), cosa que los hace independientes de un sistempa operativo concreto; eso no pasa con los moódems externos.

source: Per exemple, si tenim una unitat d'informació que pot presentar-se en 778 formes diferents, necessitarem 10 bits, perquè amb 9 bits només podem fer $$2 2 2 2 2 2 2 2 2 = 2^9 = 512$$ combinacions, però amb 10, ja en podem fer suficients, perquè $2^{10}=1.024$ (en quedarien $1024-778=246$ combinacions sense usar).
es: Por ejemplo, si tenemos una unidad de información que puede presentarse en 778 formas diferentes , necesitaremos 10 bits, porque con 9 bits sólo podemos hacer 2x 2x 2x <u3 > 2x 2x 2x 2x = 2⁹ = 512 combinaciones, pero con 10, ya podemos hacer suficientes, porque $ 2 ¹° = 1.024 (quedarían 1024-778 = 246 combinaciones sin usar).

source: Això permet enviar una carta d'una pàgina en unes dècimes de segon.
es: Esto permite enviar una carta de una página en unas décimas de segundo.

source: Deriva del processador de 16 bits 286 (80286), que al seu torn deriva del 8086, un dels primers processadors instal·lat en els PC.
es: Deriva del procesador de 16 bits 286 (80.286), que a su vez deriva del 8086, uno de los primeros procesadores instalado en los PC.

source: Com, per exemple, els signes d'alguna escriptura ideogràfica oriental
es: Como, por ejemplo, los signos de alguna escritura ideográfica oriental

source: Un monitor o pantalla, normalment una pantalla plana TFT{Les pantalles TFT (de l'anglés thin-film transistor) no porten cap tub de raigs catòdics, sinó que usen un o més transistors per a cada punt de la pantalla.
es: Un monitor o pantalla, normalmente una pantalla plana TFT {Las pantallas TFT (del inglés thin-film transistor </ i1>) no llevan ningún tubo de rayos catódicos, sino que usan uno o más transistores para cada punto de la pantalla.

source: [placa de so:] Una placa (o targeta) de so permet usar l'ordinador per a processar, enregistrar, reproduir, i manipular sons digitalitzats.
es: [Placa de sonido:] Una placa (o tarjeta) de sonido permite usar el ordenador para procesar, registrar, reproducir, y manipular sonidos digitalizados.

source: } de 17 polzades (pràcticament ja no s'instal·len monitors de tubs catòdics).
es: } De 17 pulgadas (prácticamente ya no se instalan monitores de tubos catódicos).

source: Un bit pot tenir dos valors: 0 (apagat, inactiu) o 1 (encés, actiu); això és perquè el dispositiu electrònic corresponent pot estar en dos estats.
es: Un bit puede tener dos valores: 0 (apagado, inactivo) o 1 (encendido, activo); esto es porque el dispositivo electrónico correspondiente puede estar en dos estados.

source: És capaç de processar 32 bits per cicle.
es: Es capaz de procesar 32 bits

source: Per raons històriques, els noms de fitxers solen tenir dues parts: el nom pròpiament dit i l'extensió, separades per un punt (per exemple, alacant.txt).
es: Por razones históricas, los nombres de ficheros suelen tener dos partes: el nombre </ i1> propiamente dicho y la extensión </ i2>, separadas por un punto (por ejemplo, alacant.txt </ i3>).

source: Un octet pot estar, per tant, en $2^8=256$ estats diferents.
es: Un byte puede estar, por tanto, en 2⁸ = 256 estados diferentes.

source: Els bits s'agrupen normalment en grups de vuit, anomenats { octets} o bytes.
es: Los bits se agrupan normalmente en grupos de ocho, llamados bytes </ i0>.

source: Un exemple d'algorisme/programa és el següent, que diu si dues seqüències de caràcters (també anomenades cadenes de caràcters) són iguals o no.
es: Un ejemplo de algoritmo / programa es el siguiente, que dice si dos secuencias de caracteres (también llamadas cadenas </ i0> de caracteres) son iguales o no.
